In [16]:
import pandas as pd
import numpy as np
%matplotlib inline

# Reshaping and Pivoting

## Basic `stack` and `unstack`.

In [8]:
data = pd.DataFrame(
    np.arange(6).reshape((2,3)),
    index=pd.Index(['Ohio', 'Colorado'], name='state'),
    columns=pd.Index(['one', 'two', 'three'], name='number')
)

In [9]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [10]:
r = data.stack()
r

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

In [11]:
r.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

But you may get missing data values.

In [13]:
s1 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])
s2 = pd.Series([4, 5, 6], index=['c', 'd', 'e'])

In [14]:
data2 = pd.concat([s1, s2], keys=['one', 'two'])

In [15]:
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [18]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [19]:
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [20]:
data2.unstack().stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

## Unstacking causes unstacked level to become the lowest level in the result

In [22]:
df = pd.DataFrame({
    'left': r,
    'right': r + 5
}, columns=pd.Index(['left', 'right'], name='side'))

In [23]:
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [24]:
df.unstack('state')

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [28]:
df.unstack('state').stack('side')

state         Colorado  Ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7